app/views/users/show.html.erb

SELECT `attachments`.* FROM `attachments` WHERE `attachments`.`user_id` = '4'
---
  <tbody>
    <% @user.attachments.each do |attachment| %>

SELECT `images`.* FROM `images` WHERE `images`.`attachment_id` = 27
---
        <td><%= attachment.description %></td>
        <td colspan="" rowspan="" headers=""> <%=attachment.images.length%></td>