app/views/attachments/index.html.erb

        <td><%= attachment.description %></td>
        <td><%= attachment.images.length %></td>
---
SELECT `images`.* FROM `images` WHERE `images`.`attachment_id` = 22