app/views/attachments/show.html.erb

SELECT `images`.* FROM `images` WHERE `images`.`attachment_id` = 1
---

			<% @attachment.images.each do |image| %>