app/controllers/attachments_controller.rb

SELECT `attachments`.* FROM `attachments`
---
  def index
    @attachments = Attachment.all

INSERT INTO `attachments` (`title`, `description`, `user_id`, `created_at`, `updated_at`) VALUES ('asdad', 'asdadsad', '1', '2015-05-15 10:42:12.221124', '2015-05-15 10:42:12.221124')
---
  def create
    @attachment = Attachment.new(attachment_params)
    @attachment.user = @user
        respond_to do |format|
      if @attachment.save

SELECT  `attachments`.* FROM `attachments` WHERE `attachments`.`id` = 1 LIMIT 1
---
    def set_attachment
      @attachment = Attachment.find(params[:id])