app/controllers/images_controller.rb

SELECT `images`.* FROM `images`
---
  def index
    @images = Image.all

INSERT INTO `images` (`photo_file_name`, `photo_content_type`, `photo_file_size`, `photo_updated_at`, `attachment_id`, `created_at`, `updated_at`) VALUES ('aaaa_(7th_copy).jpg', 'image/jpeg', 65558, '2015-05-15 10:43:08.038443', 1, '2015-05-15 10:43:08.685151', '2015-05-15 10:43:08.685151')
---
  def create
    respond_to do |format|
      params[:photo].each do |photo|
        @image = Image.new
        @image.photo=photo
        @image.attachment=@attachment
        if @image.save